

int main() {

    return 0;
}



/// 冒泡排序（英语：Bubble Sort）是一种简单的排序算法。
/// 它重复地走访过要排序的数列，一次比较两个元素，如果他们的顺序（如从大到小、首字母从A到Z）错误就把他们交换过来。




/// 选择排序（Selection sort）是一种简单直观的排序算法。它的工作原理如下。
/// 首先在未排序序列中找到最小（大）元素，存放到排序序列的起始位置，然后，再从剩余未排序元素中继续寻找最小（大）元素，
/// 然后放到已排序序列的末尾。以此类推，直到所有元素均排序完毕。



/// 插入排序（英语：Insertion Sort）是一种简单直观的排序算法。
/// 它的工作原理是通过构建有序序列，对于未排序数据，在已排序序列中从后向前扫描，找到相应位置并插入。
/// 插入排序在实现上，通常采用in-place排序（即只需用到 {\log O(1)} {\log O(1)}的额外空间的排序），
/// 因而在从后向前扫描过程中，需要反复把已排序元素逐步向后挪位，为最新元素提供插入空间。



///希尔排序，也称递减增量排序算法，是插入排序的一种更高效的改进版本。希尔排序是非稳定排序算法。
///希尔排序是基于插入排序的以下两点性质而提出改进方法的：
//   1、插入排序在对几乎已经排好序的数据操作时，效率高，即可以达到线性排序的效率
//   2、但插入排序一般来说是低效的，因为插入排序每次只能将数据移动一位





///归并排序，把数据分为两段，从两段中逐个选最小的元素移入新数据段的末尾。
///可从上到下或从下到上进行。

//(归并排序)迭代法：
//(归并排序)递归法：





///快速排序，在区间中随机挑选一个元素作基准，将小于基准的元素放在基准之前，大于基准的元素放在基准之后，再分别对小数区与大数区进行排序。

//(快速排序)迭代法：
//(快速排序)递归法：